I've tried to extend `example/resource_virtual_environment_vm.tf` with the following:
```terraform
resource "proxmox_virtual_environment_vm" "example_new" {
  name      = "terraform-provider-proxmox-example-new"
  node_name = data.proxmox_virtual_environment_nodes.example.names[0]
  pool_id   = proxmox_virtual_environment_pool.example.id

  clone {
    vm_id = proxmox_virtual_environment_vm.example_template.id
  }

  memory {
    dedicated = 768
  }

  connection {
    type        = "ssh"
    agent       = false
    host        = element(element(self.ipv4_addresses, index(self.network_interface_names, "eth0")), 0)
    private_key = tls_private_key.example.private_key_pem
    user        = "ubuntu"
  }

  provisioner "remote-exec" {
    inline = [
      "echo Welcome to $(hostname)!",
    ]
  }
}
```

Which results in the following plan:
```terraform
Terraform will perform the following actions:

  # proxmox_virtual_environment_vm.example_new will be created
  + resource "proxmox_virtual_environment_vm" "example_new" {
      + acpi                    = true
      + bios                    = "seabios"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + name                    = "terraform-provider-proxmox-example-new"
      + network_interface_names = (known after apply)
      + node_name               = "proxmox"
      + on_boot                 = false
      + pool_id                 = "terraform-provider-proxmox-example"
      + reboot                  = false
      + started                 = true
      + tablet_device           = true
      + template                = false
      + timeout_clone           = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = -1

      + clone {
          + full    = true
          + retries = 1
          + vm_id   = 2040
        }

      + memory {
          + dedicated = 768
          + floating  = 0
          + shared    = 0
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

Which produces a clone call similar to this:
```
[DEBUG] Added request body to HTTP POST request (path: nodes/proxmox/qemu/2040/clone) - Body: full=1&name=terraform-provider-proxmox-example-new&newid=100&pool=terraform-provider-proxmox-example
```

Which results in a new VM being created with ID 100.

In case I run another plan, no changes to the resource shows up:
```terraform
Terraform will perform the following actions:

Plan: 0 to add, 0 to change, 0 to destroy.
```

@fabacab can you check whether you still experience the described issue?